function c(txt){
    if(typeof txt == "string"){
        let ms = [ // \033[??m + text + \033[m
            ["Сброс цветов",     "[m"           ],
            ["Тёмно-красный",    "[31m", "[41m" ],
            ["Тёмно-зелёный",    "[32m", "[42m" ],
            ["Тёмно-жёлтый",     "[33m", "[43m" ],
            ["Тёмно-синий",      "[34m", "[44m" ],
            ["Темно-пурпурный",  "[35m", "[45m" ],
            ["Тёмно-голубой",    "[36m", "[46m" ],
            ["Красный",          "[91m", "[101m"],
            ["Зелёный",          "[92m", "[101m"],
            ["Оранжевый",        "[93m", "[103m"],
            ["Синий",            "[94m", "[104m"],
            ["Пурпурный",        "[95m", "[105m"],
            ["Голубой",          "[96m", "[106m"],
            ["Светло-серый",     "[37m", "[47m" ],
            ["Тёмно-серый",      "[90m", "[100m"],
            ["Стандартный",      "[39m", "[49m" ],
            ["Чёрный",           "[30m", "[40m" ],
            ["Белый",            "[97m", "[107m"]
        ]
        console.log( "\033" + ms[1][1] + txt + "\033" + ms[0][1] )
    }else{
        console.log( txt )
    }
}

module.exports = c























    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    